{"tag_name":"v20.12","name":"Di Layanan Mandiri, tampilkan notifikasi pesan baru bagi pengguna","zipball_url":"https:\/\/api.github.com\/repos\/OpenSID\/OpenSID\/zipball\/v20.12","tarball_url":"https:\/\/api.github.com\/repos\/OpenSID\/OpenSID\/tarball\/v20.12","body":"Di rilis ini, versi 20.12 tersedia tampilan notifikasi pesan baru bagi pengguna di Layanan Mandiri. Rilis ini juga berisi perbaikan lain yang diminta Komunitas SID.\r\n\r\nTerima kasih pada afa28, Zeppy Shiddiq, Nopezi Saputra, Agung Sugiarto dan Yonathan Rizky yang terus berkontribusi.\r\n\r\nLengkapnya, isi rilis versi 20.12 adalah sebagai berikut:\r\n\r\n1. Perbaiki kode desa\/kecamatan\/kabupaten yang ditampilkan di beberapa lampiran surat. [bug-fix]\r\n2. #3721: Tampilkan sebutan desa dan dusun di halaman Calon Pemilih, statistik Wilayah dan menu untuk menampilkan desa dan dusun di peta. [bug-fix]\r\n3. #2097: Menu statis sekarang dapat menampilkan kategori artikel dinamis.\r\n4. #3726: Sekarang data desa kembali tampil di laporan biodata penduduk. [bug-fix]\r\n5. #3722: Tampilkan jumlah RW di halaman statis Wilayah Administratif.\r\n6. #3740: Perbaiki nomor Rumah Tangga kembali menggunakan awalan kode desa saja. [bug-fix]\r\n7. Di Layanan Mandiri, sekarang pilihan dokumen kelengkapan dibatasi sesuai dengan jenis dokumen yang diperlukan.\r\n8. Tampilkan Jenis Dokumen di tabel dokumen kelengkapan penduduk di Layanan Mandiri dan di Admin.\r\n9. Sekarang jenis dokumen dapat diisi di form Penduduk > Dokumen.\r\n10. #1763: Sekarang bisa ubah masa berlaku default untuk setiap jenis surat layanan.\r\n11. #3735: Sekarang persyaratan permohonan surat bisa dikosongkan, dan juga hanya terisi apabila surat disediakan di layanan mandiri. [bug-fix]\r\n12. #3755: Sekarang feed RSS OpenSID kembali normal. [bug-fix]\r\n13. #3736: Sediakan tombol Kembali ke Atas di tampilan web.\r\n14. Kirim token ke TrackSID sebagai verifikasi OpenSID valid. [teknis]\r\n15. Sekarang impor data Rumah Tangga melaporkan error kepala Rumah Tangga ganda, dan jika terjadi menghapus rumah tangga secara konsisten. [bug-fix]\r\n16. #3186: Di Layanan Mandiri, tampilkan notifikasi pesan baru bagi pengguna.\r\n17. #3767: Perbaiki judul tab browser modul web mengutamakan keterangan isi halaman.\r\n18. #3771: Sekarang tampilan case huruf Romawi bagian dari teks judul atau nama dusun tidak diubah.\r\n19. #3758: Sekarang sitemap.xml tampil benar kembali. [bug-fix]\r\n20. Sesuaikan baris header ekspor data penduduk untuk OpenDK di Pengaturan > Database.\r\n21. #3761: Munculkan semua artikel dinamis pada saat membuka Admin Web > Artikel.\r\n\r\n\r\nSelalu diingatkan, apabila meng-upgrade (yaitu bukan install baru) dari versi SEBELUM versi 20.12, lakukan Database > Migrasi DB untuk menyesuaikan struktur database dan folder desa.\r\n\r\nInstaller untuk Windows buatan Zulkarnaini dapat diunduh di:\r\nWindows 64 Bit : [setup_openSID_20.12.exe 64 bit](https:\/\/drive.google.com\/file\/d\/1_YEyWfAZHuJaBC_Gi2M1bjVnLrraIQv7\/view)\r\nWindows 32 Bit : [setup_OpenSID_v20.12.exe 32 bit](https:\/\/drive.google.com\/file\/d\/13wMab0hIxEjRyKJwTSimma75UUxfIVnf\/view)\r\n","created_at":"2020-12-01T00:36:17Z","published_at":"2020-12-01T01:10:52Z"}